{
  "basics": {
    "name": "Allan M. de Souza",
    "label": "Scientist",
    "image": "",
    "email": "allanms@unicamp.br",
    "phone": "(19) 3521-5838",
    "url": "https://allanmsouza.github.io/",
    "location": {
      "address": " Av. Albert Einstein, 1251",
      "postalCode": "13083-852",
      "city": "Campinas",
      "countryCode": "SP",
      "region": "São Paulo"
    },
    "profiles": [
      
    ]
  },
  "work": [
    {
      "name": "Institute of Computing, University of Campinas",
      "position": "Professor ",
      "url": "https://icunicamp.br/~allanms",
      "startDate": "2023-10-01",
      "endDate": "-",
      "summary": "Professor and Researcher in Computer Science",
      "highlights": [
        
      ]
    }
  ],
  "volunteer": [],
  "education": [
    {
      "institution": "University of Campinas, Campinas, Brazil",
      "url": "https://ic.unicamp.br/",
      "area": "Federated Learning",
      "studyType": "Postdoctoral",
      "startDate": "2021-08-01",
      "endDate": "-",
      "score": "",
      "courses": [
        "Artificial Inteligence",
        "Distributed Systems"
      ]

    },
    {
      "institution": "University of Campinas, Campinas, Brazil, with double Diploma at University of Bern, Bern, Switzerland",
      "url": "https://ic.unicamp.br/",
      "area": "Distributed Systems",
      "studyType": "PhD",
      "startDate": "2017-08-01",
      "endDate": "2021-06-01",
      "score": "",
      "courses": [
        "Intelligent Transportation Systems",
        "Machine Learning"
      ]
    },
    {
      "institution": "University of Campinas, Campinas, Brazil",
      "url": "https://ic.unicamp.br/",
      "area": "Distributed Systems",
      "studyType": "Masters",
      "startDate": "2014-02-01",
      "endDate": "2026-03-01",
      "score": "",
      "courses": [
        "Intelligent Transportation Systems",
        "Machine Learning"
      ]
    }
  ],
  "awards": [
    {
      "title": "Best Paper Award - SBRC",
      "date": "2023-05-01",
      "awarder": "XLI Simpósio Brasileiro de Redes de Computadores e Sistemas Distribuídos da Sociedade Brasileira de Computação",
      "summary": ""
    },
    {
      "title": "Best Paper Award - ICEIS",
      "date": "2022-05-01",
      "awarder": "24th International Conference on Enterprise Information Systems (ICEIS)",
      "summary": "First place for the paper - MCCD: Generating Human Natural Language Conversational Datasets"
    },
    {
      "title": "Best PhD Thesis Award - CTD-SBRC",
      "date": "2022-05-01",
      "awarder": "III Concurso de Teses e Dissertações - CTD, XL Simpósio Brasileiro de Redes de Computadores e Sistemas Distribuídos (SBRC).",
      "summary": "First place at the contest for the thesis - Towards a Personalized Multi-objective Vehicular Traffic Re-routing System"
    },
    {
      "title": "Best PhD Thesis Award - University of Campinas",
      "date": "2022-05-01",
      "awarder": "Concurso de Teses e Dissertações Universidade Estadual de Campinas",
      "summary": "First place at the contest for the thesis - Towards a Personalized Multi-objective Vehicular Traffic Re-routing System"
    },
    {
      "title": "Honorable PhD Thesis Award - CTD CSBC",
      "date": "2022-05-01",
      "awarder": "XXV Concurso de Teses e Dissertações - CTD (Doutorado), Sociedade Brasileira de Computação (CSBC)",
      "summary": "Second place at the contest for the thesis - Towards a Personalized Multi-objective Vehicular Traffic Re-routing System"
    },
    {
      "title": "Best PhD Thesis Award - CLTD CLEI",
      "date": "2022-05-01",
      "awarder": "VIII Concurso Latino-Americado de Dissertações e Teses de Doutorado - CLTD, Conferência Latino-Americana de Informática (CLEI)",
      "summary": "First place at the contest for the thesis - Towards a Personalized Multi-objective Vehicular Traffic Re-routing System"
    },
    {
      "title": "Honorable PhD Thesis Award - Capes",
      "date": "2022-05-01",
      "awarder": "Prêmio Capes de Teses.",
      "summary": "Second Place at the contest for the thesis - Towards a Personalized Multi-objective Vehicular Traffic Re-routing System"
    },
    {
      "title": "Best PhD Thesis Award - University of Bern",
      "date": "2021-05-01",
      "awarder": "PhD Thesis Contest @ University of Bern",
      "summary": "First Place at the contest of University of Bern for the thesis - Towards a Personalized Multi-objective Vehicular Traffic Re-routing System"
    },
    {
      "title": "Best Paper Award - SBRC",
      "date": "2018-05-01",
      "awarder": "XXXVI Simpósio Brasileiro de Redes de Computadores e Sistemas Distribuídos, Sociedade Brasileira de Computação.",
      "summary": "Second place for the paper - Por Aqui é Mais Seguro: Melhorando a Mobilidade e a Segurança nas Vias Urbanas"
    },
    {
      "title": "Best Master Thesis Award - CTD CSBC",
      "date": "2017-05-01",
      "awarder": "XXX Concurso de Teses e Dissertações - CTD (Mestrado), Sociedade Brasileira de Computação (CSBC)",
      "summary": "First place at the contest for the thesis - Controle de Congestionamento de Veículos Utilizando Sistemas de Transporte Inteligentes"
    },
    {
      "title": "Best Paper Award - SBRC",
      "date": "2017-05-01",
      "awarder": "XXXV Simpósio Brasileiro de Redes de Computadores e Sistemas Distribuídos, Sociedade Brasileira de Computação.",
      "summary": "Second place at conference for the paper - GTE: Um Sistema para Gerenciamento de Trânsito Escalável baseado em Compartilhamento Oportunista"
    },
    {
      "title": "Best Master Thesis Award - University of Campinas",
      "date": "2016-05-01",
      "awarder": "XXXV Simpósio Brasileiro de Redes de Computadores e Sistemas Distribuídos, Sociedade Brasileira de Computação.",
      "summary": "First place at contest for the thesis - Controle de Congestionamento de Veículos Utilizando Sistemas de Transporte Inteligentes"
    }
    
    
  ],
  "certificates": [],
  "publications": [],
  "skills": [],
  "languages": [
    {
      "language": "Portuguese",
      "fluency": "Native speaker"
    },
    {
      "language": "English",
      "fluency": "Fluent"
    }
  ],
  "interests": [],
  "references": [],
  "projects": [
    {
      "name" : "Agentes Inteligentes Para Plataformas Móveis Baseados em Tecnologias de Arquitetura Cognitiva",
      "startDate": "2021-08-01",
      "endDate": "-",
      "summary" : "O advento dos dispositivos inteligentes capazes de produzir enormes quantidades de dados em diferentes granularidades, juntamente com os avanços da inteligência artificial e aprendizado de máquina, abriram caminho para o desenvolvimento de serviços e soluções inteligentes para melhorar o cotidiano de milhões de pessoas em todo o mundo, alterando a maneira como vivemos, trabalhamos e nos divertimos. Entretanto, problemas emergem em decorrência do fato da inteligência desses serviços/soluções não estarem presentes nos dispositivos onde os dados são gerados ou onde serviços são consumidos, mas sim executando em um centro de dados de nuvem. Dentre esses problemas, podemos destacar: o aumento da comunicação entre dispositivos e a nuvem; e a privacidade dos dados compartilhados entre as entidades. Diante desses problemas, o surgimento e avanço de modelos de computação distribuída na borda da rede e, de forma mais generalizada, MEC, em conjunto com o modelo de aprendizado federado (FL), permitem serviços e soluções inteligentes mais eficientes e seguros. A arquitetura MEC coloca recursos de computação na borda da rede, permitindo que tarefas de computação intensiva tenham uma resposta em tempo real ou quase em tempo real, com reduzido ou inexistente atraso de rede. Assim, o conceito de MEC permite aplicar técnicas de aprendizado de máquina para fornecer soluções inteligentes em tempo real. Por outro lado, o FL permite um treinamento de modelos distribuídos que preservam a privacidade dos dados dos usuários. Em resumo, o FL permite que dispositivos distribuídos aprendam de forma colaborativa um modelo compartilhado, mantendo todos os dados de treinamento no dispositivo, separando a capacidade de fazer aprendizado de máquina da necessidade de armazenar os dados na nuvem. Dessa forma, é possível mitigar muitos dos riscos e custos sistêmicos de privacidade resultantes de abordagens de aprendizado de máquina tradicionais e centralizadas."
    },
    {
      "name" : "Soluções para Sistemas de Transporte Inteligentes e Cooperativos baseados na Computação Urbana",
      "startDate": "2020-08-01",
      "endDate": "2021-08-01",
      "summary" : "Este projeto explorou o uso de técnicas de aprendizado de máquina para expandir os recursos de sistemas de transporte inteligentes para fornecer serviços mais inteligentes, eficientes e confiáveis."
    },
    {
      "name" : "Sistema de Análise de Incidência Criminal em Vias Urbanas para Gerenciamento de Tráfego Seguro",
      "startDate": "2017-08-01",
      "endDate": "2019-08-01",
      "summary" : "Recentemente, muitas cidades estão enfrentando problemas de mobilidade e segurança, comumente relacionados aos congestionamentos e aos índices elevados de incidentes criminais. Muitos sistemas de transporte inteligentes (ITSs) foram desenvolvidos para tratar o problema de mobilidade urbana, ao mesmo tempo, alguns sistemas baseados em segurança foram criados para direcionar veículos pedestres por rotas mais seguras. Entretanto, a maioria desses sistemas consideram apenas um problema. Portanto, um ITS pode direcionar veículos por ruas perigosas, a fim de evitar congestionamentos, enquanto sistemas baseados em segurança podem guiar veículos para vias congestionadas visando melhorar a segurança dos motoristas e passageiros."
    },
    {
      "name" : "iCities: Desenvolvimento de Serviços de nova Geração Inteligentes e Aplicações para Cidades Inteligentes",
      "startDate": "2014-08-01",
      "endDate": "2016-08-01",
      "summary" : "O projeto de pesquisa iCities visa à construção de uma infraestrutura para viabilização de cidades inteligentes, abrangendo desde o sensoriamento urbano, o armazenamento desses dados, a comunicação, até a construção de aplicações que se beneficiem de toda essa infraestrutura. Nesse contexto, problemas como a aquisição de dados nas redes veiculares, redes de sensores sem fio e redes de veículos aéreos não tripulados, bem como dados sociais reunidos a partir de cidadãos e visitantes através de seus dispositivos de comunicação e suas mensagens postadas nas redes sociais devem ser armazenados e utilizados por aplicações com o objetivo de prover uma base de dados com diferentes informações sobre a cidade. A pesquisa do presente projeto tem como objetivo a concepção de soluções para vários problemas, como: trânsito, vigilância, atendimento de emergência e monitoramento ambiental. Inovações científicas e técnicas no projeto iCities visam permitir a melhoria dos serviços prestados aos cidadãos, especialmente no caso de grandes eventos, como a próxima Copa do Mundo e as Olimpíadas que serão realizados no Brasil em 2014 e 2016, respectivamente"
    }

  ]
}